import styles from "./page.module.css";

export default function Home() {
  return (
    <div className={styles.page}>
      <p>Не зміг зробити логінацію і пагінацію. З тегами також не розібрався. Це тягнеться ще з React-у.</p>
      <p>Форму в логінації зробив, але не знаю як перекинути обєкт formDataProps з username і password в login на
        LoginComponent </p>
      <p>Зробив те що зрозумів і зміг повторити по Next-у. Зробив 2 менюшки, щоб було легше переходити по лінках. Зробив
        переходи з auth і без, щоб можна було працювати з обєктами users і recipes (бо не зробив логінацію).</p>
      <p>Як для нульового початківця, мені ця контрольна була дуже важкою. Не все було показано на лекціях. Пробував
        питати ChatGPT, але його відповіді мені мало зрозумілі, бо відрізняються від того, що давали на лекціях.</p>
      <p>Висилаю контрольну для того, щоб показати, що я зміг засвоїти, а не просто забив на неї.</p>
      <p>Дуже не вистачає ментора поруч, з яким можна було б радитись і отримувати відразу відповіді. Бо потратив дуже багато
        часу в пусту на самостійні спроби пошуку вирішення. Потрібно, щоб хтось вказував правильний напрям.</p>

    </div>
  );
}
